---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InsufficientResourcesException
source: html/e0b20083-2764-8759-7f6d-1cad03db5b43.htm
---
# InsufficientResourcesException Methods

Retrieves data needed to serialize the target object.